Revit 2024 API
ConicalSurface.Axis Property
 Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ Axis { get; }
Visual Basic
Public ReadOnly Property Axis As XYZ
	Get
Visual C++
public:
property XYZ^ Axis {
	XYZ^ get ();
}
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace